# unstack()/stack()/set_index()/reset_index()/

In [70]:
import numpy as np
import pandas as pd

data = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                    [1, 2, 3, 1, 2, 3, 1, 2, 3]]
                )

data

a  1    0.856237
   2    0.107996
   3   -0.643285
b  1   -0.698136
   2   -0.492091
c  3    0.176667
   1   -1.526844
d  2   -0.683068
   3   -1.266300
dtype: float64

### (unstack)----->index to columns,不能有重複

In [71]:
unstack_data = data.unstack()
unstack_data.fillna(0)

          1         2         3
a  0.856237  0.107996 -0.643285
b -0.698136 -0.492091  0.000000
c -1.526844  0.000000  0.176667
d  0.000000 -0.683068 -1.266300

In [72]:
data['b']

1   -0.698136
2   -0.492091
dtype: float64

In [73]:
data.loc[['a','b'],2]

a  2    0.107996
b  2   -0.492091
dtype: float64

In [74]:
#4維
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                    index=[['a','a','b','b'],[1, 2, 1, 2]],
                    columns=[['台北','台北','台中'],['Green','Red','Green']])
frame

       台北        台中
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [75]:
taipei = frame['台北']
taipei

     Green  Red
a 1      0    1
  2      3    4
b 1      6    7
  2      9   10

### (stack)----->堆疊變Series

In [76]:
taipei_series = taipei.stack()
taipei_series

a  1  Green     0
      Red       1
   2  Green     3
      Red       4
b  1  Green     6
      Red       7
   2  Green     9
      Red      10
dtype: int32

In [77]:
taipei_series.unstack(level=[0,2])

      a         b
  Green Red Green Red
1     0   1     6   7
2     3   4     9  10

In [78]:
taipei_series.unstack(level=[2,0])

  Green Red Green Red
      a   a     b   b
1     0   1     6   7
2     3   4     9  10

In [79]:
frame.stack()

             台中  台北
a 1 Green   2.0   0
    Red     NaN   1
  2 Green   5.0   3
    Red     NaN   4
b 1 Green   8.0   6
    Red     NaN   7
  2 Green  11.0   9
    Red     NaN  10

In [80]:
frame.stack(level=[0,1])

a  1  台中  Green     2.0
      台北  Green     0.0
          Red       1.0
   2  台中  Green     5.0
      台北  Green     3.0
          Red       4.0
b  1  台中  Green     8.0
      台北  Green     6.0
          Red       7.0
   2  台中  Green    11.0
      台北  Green     9.0
          Red      10.0
dtype: float64

In [81]:
#unstack,沒有的值,會自動加入nan
frame.stack(level=[0,1]).unstack(level=[0,3]).fillna(0)

         a          b
     Green  Red Green   Red
1 台中   2.0  0.0   8.0   0.0
  台北   0.0  1.0   6.0   7.0
2 台中   5.0  0.0  11.0   0.0
  台北   3.0  4.0   9.0  10.0

### (set_index(　))------>columns to index

In [82]:
import numpy as np
import pandas as pd

frame = pd.DataFrame({'a':range(7), 'b':range(7, 0, -1),
                     'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                     'd':[0, 1, 2, 0, 1, 2, 3]})

In [83]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [84]:
frame.set_index('c')

     a  b  d
c
one  0  7  0
one  1  6  1
one  2  5  2
two  3  4  0
two  4  3  1
two  5  2  2
two  6  1  3

In [85]:
dataFrame = frame.set_index(['c','d'])
dataFrame

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

### (reset_index( ))----->index to columns

In [86]:
dataFrame.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1